SIMISA@@@@@@@@@@JINX0D0t______
 
Wagon ( MML_73003
    Type ( Engine )
    WagonShape ( MML_73003.s )
    Size  ( 2.63m 4.15m 11.69m )
    CentreOfGravity ( 0m 2.09245m 0m )
    Centre ( 0m 0m 0m )
    Mass ( 76.25t )
    InertiaTensor ( Box ( 2.63m 4.15m 11.58m ) )
      FreightAnim ( "..\\common.crew\\LIB_1\\73xxx_MP.s" 0 3.0 0.0 )

    Coupling (
		Type ( Bar )
		Spring (
			Stiffness ( 1e7N/m 1e7N/m )
			Damping ( 0.2e7N/m/s 0.2e7N/m/s )
			Break ( 6e7N 6e7N )
			r0 ( 10cm 1e9 )
		)
		CouplingHasRigidConnection ( 1 )
	)
	
	Coupling (
			Type ( Chain )
			Spring (
			Stiffness ( 1e6N/m 2e6N/m )
			Damping ( 1e6N/m/s 1e6N/m/s )
			Break ( 7e8N 7e8N )
			r0 ( 20cm 40cm )
			)


	Velocity (0.1m/s)

	)

	Buffers (
			Spring (
			Stiffness ( 1e6N/m 5e6N/m )
			Damping ( 1e6N/m/s 1e6N/m/s )
			r0 ( 0cm 1e9 )
			)
			Centre ( 1.5 )
			Radius ( 1 )
			Angle ( 2.5deg )
	)     

    Adheasion ( 0.250 0.3 2 0 )
 DerailRailHeight ( 4cm )
 DerailRailForce ( 240kN )
 DerailBufferForce ( 400kN )
 WheelRadius ( 0.5m )
 NumWheels ( 1 )
 Friction (
 6148N/m/s   0  1mph  13.89N/m/s  1.8
 5.1N/rad/s  1  -1rad/s  0  1
 )
 
 BrakeEquipmentType ( "Triple_valve, Vacuum_single_pipe, Auxilary_reservoir, Emergency_brake_reservoir" )
 BrakeSystemType ( "Vacuum_single_pipe" )
 MaxBrakeForce ( 75000N )
 TripleValveRatio( 2.5 )
 MaxReleaseRate( 5 )
 MaxApplicationRate( 5 )
 MaxAuxilaryChargingRate( 21 )
 EmergencyResCapacity( 21 )
 EmergencyResChargingRate( 21 )
 BrakeCylinderPressureForMaxBrakeBrakeForce( 21 )
 MaxBrakeForce( 75000N )
 MaxHandbrakeForce( 75000N )
 NumberOfHandbrakeLeverSteps( 20 )
 MaxReleaseRate( 5 )
 MaxApplicationRate( 5 )
 MaxAuxilaryChargingRate( 21 )
 BrakeCylinderPressureForMaxBrakeBrakeForce( 21 )   

    	Sound ( "..\\..\\Common.Sound\\2cyl_generic\\2c-100b-engpas-5MT.sms" )

   Lights ( 13

   Light ( 
   comment( Gauge glass Lamp )
   Type ( 0 )
   Conditions (
   Headlight ( 3 )
   Unit ( 2 )
   )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle ( 0 )
   States ( 1
   State (
   Duration ( 0.0 )
   LightColour ( 80ffe610 )
   Position ( 0.17 3.2 -4.550 )
   Azimuth ( -180 -180 -180 )
   Transition ( 0 )
   Radius ( 0.25 )
     )
    )
   )
   
   Light ( 
   comment( Chimney Sparks RS1AA ) 
   Type  ( 0 )
   Conditions (
   Headlight ( 3 )
   Unit ( 2 )
   TimeOfDay ( 0 )
   Weather ( 0 )
   Coupling ( 0 )  
   )
   Cycle ( 0 ) 
   FadeIn ( 0 ) 
   FadeOut ( 0.5 ) 
   States ( 28 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 6.22 3.48 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.235 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 4.22 3.48 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.235 ) 
   ) 
   State ( 
   Duration ( 0.25 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.42 3.48 )

   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.235 ) 
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 6.72 3.48 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.230 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 4.52 3.48 )
 
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 0.235 ) 
   ) 
   State ( 
   Duration ( 0.25 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 4.72 3.48 )
 
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 0.235 ) 
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 6.92 3.48 )
 
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 0.230 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 4.32 3.48 )
  
   Azimuth ( 90 90 90 ) 
   Transition ( 0 ) 
   Radius ( 0.235 ) 
   ) 
   State ( 
   Duration ( 0.25 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.52 3.48 )
 
   Azimuth ( 90 90 90 ) 
   Transition ( 0 ) 
   Radius ( 0.235 ) 
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.92 3.48 )
 
   Azimuth ( 90 90 90 ) 
   Transition ( 0 ) 
   Radius ( 0.226 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.35 3.48 )
 
   Azimuth ( -180 -180 -180 ) 
   Transition ( 0 ) 
   Radius ( 0.235 ) 
   ) 
   State ( 
   Duration ( 0.25 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.55 3.48 )
 
   Azimuth ( -180 -180 -180 ) 
   Transition ( 0 ) 
   Radius ( 0.25 ) 
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 6.22 3.48 )
 
   Azimuth ( -180 -180 -180 ) 
   Transition ( 0 ) 
   Radius ( 0.230 ) 
   ) 
   State ( 
   Duration ( 0.25 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 4.22 3.48 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.235 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 4.22 3.48 )
 
   Azimuth ( 90 90 90 ) 
   Transition ( 0 ) 
   Radius ( 0.235 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 6.22 3.48 )
 
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 0.235 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 7.22 3.48 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.235 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.22 3.48 )
 
   Azimuth ( -180 -180 -180 ) 
   Transition ( 0 ) 
   Radius ( 0.235 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.22 3.48 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.235 ) 
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 00000000 ) 
   Position ( 0 5.22 3.48 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.235 ) 
   ) 
   State ( 
   Duration ( 0.4 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.22 3.48 )
 
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 0.25 ) 
   ) 
   State ( 
   Duration ( 0.25 ) 
   LightColour ( 00000000 ) 
   Position ( 0 5.22 3.48)
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.235 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 6.22 3.48 )
 
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 0.235 ) 
   ) 
   State ( 
   Duration ( 0.5 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.22 3.48 )
 
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 0.235 ) 
   ) 
   State ( 
   Duration ( 0.4 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.22 3.48 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.233 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 00000000 ) 
   Position ( 0 6.22 3.48 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.23 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.22 3.48 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.23 ) 
   ) 
   State ( 
   Duration ( 0.6 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 9.22 3.48 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.230 ) 
                  )
               )
          )
     
   Light (
   comment( Sphere of light for Exhaust )
   Type  ( 1 )
   Conditions (
   Headlight ( 3 )
   Unit ( 2 )
   )
   Cycle  ( 0 )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   States ( 1
   State (
   Duration ( 0.0 )
   LightColour ( 80ffe610 )
   Position ( 0 10.0 -14.75 )
   Transition ( 0 )
   Radius ( 6.0 )
   Angle ( 90.0 )
              )
         )
   )
   Light (
   comment( Inside Cab Glare )
   Type  ( 0 )
   Conditions (
   Headlight ( 3 )
   Unit ( 2 )
   )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle  ( 0 )
   States ( 2
   State (
   Duration ( 0.05 )
   LightColour ( 80ffe610 )
   Position ( 0 2.50 -5.3 )
   Azimuth ( 0.0 -5.0 5.0 )
   Transition ( 0 )
   Radius ( 2.0 )
   Elevation ( -25 -25 -25 )
   )
   State (
   Duration ( 0.05 )
   LightColour ( 80ffe610 )
   Position ( 0 2.50 -5.3 )
   Azimuth ( 0.0 -5.0 5.0 )
   Transition ( 0 )
   Radius ( 2.0 )
   Elevation ( -25 -25 -25 )
     )
    )
   )
   Light (
   comment( Inside Cab Glare Back )
   Type  ( 0 )
   Conditions (
   Headlight ( 3 )
   Unit ( 2 )
   )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle  ( 0 )
   States ( 2
   State (
   Duration ( 0.05 )
   LightColour ( 80ffe610 )
   Position ( 0 2.50 -5.3 )
   Azimuth ( -180 -180 -180  )
   Transition ( 0 )
   Radius ( 2.0 )
   Elevation ( -25 -25 -25 )
   )
   State (
   Duration ( 0.05 )
   LightColour ( 80ffe610 )
   Position ( 0 2.50 -5.3 )
   Azimuth ( -180 -180 -180 )
   Transition ( 0 )
   Radius ( 2.0 )
   Elevation ( -25 -25 -25 )
    )
    
   )
  )
   
  Light (
   comment( Flickering Ashpan Front )
   Type  ( 0 )
   Conditions (
   Headlight ( 3 )
   Unit ( 2 )
   )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle ( 0 )
   States ( 2
   State (
   Duration ( 0.05 )
   LightColour ( 80ff7200 )
   Position ( 0 0.63 -2.12 )
   Azimuth ( -90 -90 -90 )
   Transition ( 0 )
   Radius ( 1 )
   )
   State (
   Duration ( 0.05 )
   LightColour ( 80ff7200 )
   Position ( 0 0.63 -2.12 )
   Azimuth ( -180 -180 -180 )
   Transition ( 0 )
   Radius ( 1 )
         
     )
    )
   )

   Light (
   comment( Flickering Ashpan Front )
   Type  ( 0 )
   Conditions (
   Headlight ( 3 )
   Unit ( 2 )
   )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle ( 0 )
   States ( 2
   State (
   Duration ( 0.05 )
   LightColour ( 80ff7200 )
   Position ( 0 0.6 -2.12 )
   Azimuth ( 45 45 45 )
   Transition ( 0 )
   Radius ( 1 )
   )
   State (
   Duration ( 0.05 )
   LightColour ( 80ff7200 )
   Position ( 0 0.6 -2.12 )
   Azimuth ( 180 180 180 )
   Transition ( 0 )
   Radius ( 1 )
         
     )
    )
   )

   Light (
   comment( Flickering Ashpan Front )
   Type  ( 0 )
   Conditions (
   Headlight ( 3 )
   Unit ( 2 )
   )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle ( 0 )
   States ( 2
   State (
   Duration ( 0.05 )
   LightColour ( 80ff7200 )
   Position ( 0 0.6 -2.12 )
   Azimuth ( 180 180 180 )
   Transition ( 0 )
   Radius ( 1 )
   )
   State (
   Duration ( 0.05 )
   LightColour ( 80ff7200 )
   Position ( 0 0.6 -2.12 )
   Azimuth ( 180 180 180 )
   Transition ( 0 )
   Radius ( 1 )
         
     )
    )
   )

   Light (
   comment( Flickering Ashpan Front Leading )
   Type  ( 0 )
   Conditions (
   Headlight ( 3 )
   Unit ( 2 )
   )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle  ( 0 )
   States ( 2
   State (
   Duration ( 0.05 )
   LightColour ( 80ff7200 )
   Position ( 0 0.64 -2.12 )
   Azimuth ( 0.0 -5.0 5.0 )
   Transition ( 0 )
   Radius ( 1 )
   Elevation ( -10 -10 -10 )
   )
   State (
   Duration ( 0.05 )
   LightColour ( 80ff7200 )
   Position ( 0 0.64 -2.12 )
   Azimuth ( 0.0 -5.0 5.0 )
   Transition ( 0 )
   Radius ( 1 )
   Elevation ( -10 -10 -10 )
     )
    )
   )

   Light (
   comment( Flickering Ashpan Back )
   Type  ( 0 )
   Conditions (
   Headlight ( 0 )
   Unit ( 0 )
   )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle ( 0 )
   States ( 2
   State (
   Duration ( 0.05 )
   LightColour ( 80ff7200 )
   Position ( 0 0.5 -4.5 )
   Azimuth ( -180 -180 -180 )
   Transition ( 0 )
   Radius ( 1 )
   )
   State (
   Duration ( 0.05 )
   LightColour ( 80ff7200 )
   Position ( 0 0.5 -4.5 )
   Azimuth ( -180 -180 -180 )
   Transition ( 0 )
   Radius ( 1 )
         
     )
    )
   )
   Light ( 
   comment( Ashpan flashes ) 
   Type ( 0 ) 
   Conditions ( 
   Headlight ( 3 ) 
   Unit ( 0 ) 
   ) 
   Cycle ( 0 ) 
   FadeIn ( 0 ) 
   FadeOut ( 0.5 ) 
   States ( 28 
   State ( 
   Duration ( 1 ) 
   LightColour ( 00000000 ) 
   Position ( -0.1 0.14 -4.10 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -4.10 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.30 ) 
   LightColour ( 00000000 ) 
   Position ( -0.1 01.4 -4.10 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.4 -4.10 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -4.10 )
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.30 ) 
   LightColour ( 00000000 ) 
   Position ( -0.1 0.14 -4.10 )
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -4.10 )
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -4.10 )
   Azimuth ( 90 90 90 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.30 ) 
   LightColour ( 00000000 ) 
   Position ( -0.1 0.14 -4.10 )
   Azimuth ( 90 90 90 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -4.10 )
   Azimuth ( 90 90 90 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -4.10 )
   Azimuth ( -180 -180 -180 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.30 ) 
   LightColour ( 00000000 ) 
   Position ( -0.1 0.14 -4.10 )
   Azimuth ( -180 -180 -180 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -4.10 )
   Azimuth ( -180 -180 -180 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.5 ) 
   LightColour ( 00000000 ) 
   Position ( -0.1 0.14 -4.10 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -4.10 )
   Azimuth ( 90 90 90 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -4.10 )
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 3 ) 
   LightColour ( 00000000 ) 
   Position ( -0.1 0.14 -4.10 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -4.10 )
   Azimuth ( -180 -180 -180 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -4.10 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 5 ) 
   LightColour ( 00000000 ) 
   Position ( -0.1 0.14 -4.10 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -4.10 )
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.30 ) 
   LightColour ( 00000000 ) 
   Position ( -0.1 0.14 -4.10 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -4.10 )
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.5 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -4.10 )
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.4 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -4.10 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 00000000 ) 
   Position ( -0.1 0.14 -4.10 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -4.10 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.6 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -4.10 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
                  )
               )
          )
  
 
  Light (
   comment( Flickering firebox )
   Type  ( 0 )
   Conditions (
   Headlight ( 0 )
   Unit ( 0 )
   )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle ( 0 )
   States ( 2
   State (
   Duration ( 0.05 )
   LightColour ( 80ff7200 )
   Position ( -0 2.2 -4.5 )
   Azimuth ( -180 -180 -180 )
   Transition ( 0 )
   Radius ( 1.4 )
   )
   State (
   Duration ( 0.05 )
   LightColour ( 80ffe610 )
   Position ( -0 2.2 -4.5 )
   Azimuth ( -180 -180 -180 )
   Transition ( 0 )
   Radius ( 1.2 )
         
     )
     
    )
   )

  )

 ) 

 
 
    Engine ( MML_73003
    Effects
	(
		SteamSpecialEffects
		(
			comment
			(
				the format of these little blocks is as follow:

				offset.x offset.y offset.z
				normal.x normal.y normal.z
				width in metres

				defining the offset from the shape pivot point
				where steam / smoke should appear, the direction
				it should go and the width of the nozzle
			)

			WhistleFX
			(
				0.0 3.692 2.717
				0 0.8 0
				0.2
			)

			SafetyValvesFX
			(
				0 4.1884 -2.821
				0 -0.70 0
				0.350
			)
			SafetyValvesFX
			(
				0 3.884 -2.821
				0 1.3 0
				0.15
			)
			StackFX
			(
				0 3.953 3.344
				0 0.95 0
				0.25
			)
			DrainpipeFX
			(
				-1.5 1.258 -3.886
				-0.4 -1 -0.2
				0.05
			)

			CylindersFX
			(
				-0.972 0.776 4.150
				0 -0.4 1.4
				0.1
			)

			CylindersFX
			(
				0.972 0.776 4.150
				0 -0.4 1.4
				0.1
			)
		)
	)

    Wagon ( MML_73003 )
    Type ( Steam )
 MaxPower ( 1220hp )
 MaxForce ( 26122lbf )
 MaxVelocity ( 90mph )
 WheelRadius ( 37in )
 Sanding ( 1e9mph )
 NumWheels ( 6 )
 BoilerLength ( 6.8m )
 BoilerRadius ( 0.81m )
 BoilerVolume ( "418176*(in^3)" )
 BoilerEffectivity ( 1.2 )
 DraftingEffect ( 1 )
 BoilerResponsiveness ( 1 )
 CoalBurnage ( 7.0lb/hp/h )
 MaxBoilerOutput ( 26550lb/h )
 NumCylinders ( 2 )
 CylinderStroke ( 28in )
 CylinderDiameter ( 19in )
 CylinderVolume ( "15898*(in^3)" )
 CylinderEffectivity ( 5.0 )
 CutoffMaxForward( 0.78 )
 CutoffMaxReverse( -0.78 )
 SteamSmallestCutoff( 6 )
 InjectorSizes ( 11mm 10mm )
 ExhaustLimit ( 27550lb/h )
 PrimingFactor ( 0.9 )
 SteamMinPrimingLevel ( 1 )
 SteamPrimingPowerLossProportion ( 0.20 )
 SteamPrimingWaterUsageIncreaseProportion ( 0.25 )
 SteamPrimingInjectorsFailAtLevel ( 1.25 )
 SteamPrimingReductionWithCylinderCocksOpen ( 0.25 )
 BlastExponent ( 0.5 )
 MaxBoilerPressure ( 225psi )
 MaxFireMass ( 2875lb )
 IdealFireMass ( 2740lb )
 MaxWaterMass ( 5273lb )  
 SafetyValvesSteamUsage ( 7200lb/h )
 ShovelCoalMass ( 10lb )
 SmokeCombustion ( 20 )
 CriticalBlowbackLevel ( 1 ) 
 MaxTenderCoalMass ( 15680lb )
 MaxTenderWaterMass ( 42500lb )
 comment(0 for live steam, 1 for exhaust steam)
 InjectorTypes( 0 1 )
 Injector1FeedrateMultiplierExhaust ( 0.7 )
 Injector1FeedrateMultiplierLive ( 0.8 )
 Injector2FeedrateMultiplierExhaust ( 0 )
 Injector2FeedrateMultiplierLive ( 0 )
 Injector1WaterValveVariance ( 0.5 )
 Injector2WaterValveVariance ( 0.5 )
 SuperHeater ( 1.24 )
 SteamSmokeUnitsPerPoundOfFuel( 0.8 )
 SteamMaxSmokeUnitsReleaseRate( 20 )
 MaxSteamHeatingPressure( 50 )
 NumberOfSteamHeatingPressureSteps( 5 )
 SafetyValvePressureDifference( 5 )
 SteamGaugeGlassHeight( 10 )
 SteamFiremanMaxPossibleFiringRate( 4875 )
 BasicSteamUsage ( 750lb/h )
 BasicCoalUsage ( 112lb/h )
 comment( min steam pressure, min water proportion, max water proportion  )
 InjectorLimits1 ( 50psi 0.5 1 )
 InjectorLimits2 ( 60psi 0.5 1 )
 CylinderCocksPowerEfficiency ( 0.9 )
 SteamCylinderCocksOperation( Manual )

 EngineBrakesControllerMinPressureReduction( 6 )
 EngineBrakesControllerHasProportionalBrake( 1 )
 EngineBrakesProportionalBrakeLag( 0.9 )
 EngineBrakesControllerMaxApplicationRate( 5 )
 EngineBrakesControllerMaxReleaseRate( 5 )
 EngineBrakesControllerEmergencyApplicationRate( 21 )
 EngineBrakesControllerMinSystemPressure( 0 )
 EngineBrakesControllerMaxSystemPressure( 21 )
 EngineBrakesControllerFullServicePressureDrop( 21 )
 BrakesEngineBrakeType ( "Independent,Vacuum_single_pipe"  )
 BrakesTrainBrakeType ( "Vacuum_single_pipe" )
 BrakesEngineControllers( "Independent,Hand,Train" )
 EngineBrakesControllerDirectControlExponent( 1 )
 VacuumBrakesSmallEjectorPowerRating( 30 )
 VacuumBrakesMinBoilerPressureMaxVacuum( 110 )
 VacuumBrakesSmallEjectorUsageRate( 410 )
 VacuumBrakesLargeEjectorUsageRate( 1600 )
 VacuumBrakesHasVacuumPump( 0 )
 TrainBrakesControllerMaxReleaseRate( 0.75 )
 TrainBrakesControllerMinSystemPressure( 0 )
 TrainBrakesControllerMaxSystemPressure( 21 )
 EngineBrakesControllerHasProportionalBrake( 1 )
 EngineBrakesProportionalBrakeLag( 0.9 )

 NumberOfDamperSteps( 1 )

  RegulatorValveType ( Twin_port )
  RegulatorSecondValveStartPosition( 0.95 )
  RegulatorPilotValveExponent( 0.5 )
  RegulatorSecondValveExponent( 1.7 )
  RegulatorPilotValveFullOpenning( 0.95 )
  RegulatorMainValveInitialOpenning( 0.97 )


 SteamBlowerEffectExponent( 0.9 )
 SteamBlowerEfficiencyExponent( 1.25 )
 SteamBlowerMaxSteamUsageRate( 1200 )comment( lbs/h )
 SteamBlowerMaxProportionOfBlastEffect( 0.175 )

 SteamWaterScoopMinPickupSpeed( 25 )comment( mph )
 SteamWaterScoopMaxPickupSpeed( 75 )comment( mph )
 SteamWaterScoopResistance( 8000N )
 comment( pounds per second. 2000gallons per minute max. )
 SteamWaterScoopMaxPickupRate( 2000 )
 SteamSmokeUnitsPerPoundOfFuel( 0.8 )

     
    Cabview ( Standard.cvf )
    HeadOut (  -1.4 3.0 -5.7 )

        EngineControllers (
            comment( Engine controls )
        
            Regulator ( 0 1 0.01 0 
            NumNotches( 0 )
            )
            Cutoff    ( -0.78 0.78 0.0075 0 
                NumNotches( 23
    			  Notch ( -0.78 0 Dummy )
                    Notch ( -0.65 0 Dummy )
                    Notch ( -0.55 0 Dummy )
                    Notch ( -0.45 0 Dummy )
    			  Notch ( -0.40 0 Dummy )
                    Notch ( -0.35 0 Dummy )
    			  Notch ( -0.30 0 Dummy )
			  Notch ( -0.25 0 Dummy )
			  Notch ( -0.20 0 Dummy )
			  Notch ( -0.15 0 Dummy )
			  Notch ( -0.10 0 Dummy )
			  Notch ( 0.0   0 Dummy )
    			  Notch ( 0.10  0 Dummy )
    			  Notch ( 0.15  0 Dummy )
                    Notch ( 0.20  0 Dummy )
                    Notch ( 0.25  0 Dummy )
                    Notch ( 0.30  0 Dummy )
    			  Notch ( 0.35  0 Dummy )
                    Notch ( 0.40  0 Dummy )
    			  Notch ( 0.45  0 Dummy )
			  Notch ( 0.55  0 Dummy )
			  Notch ( 0.65  0 Dummy )
			  Notch ( 0.78  0 Dummy )

               	)
            )
    		Brake_Engine ( 0 1 0.025 0
            NumNotches( 0 ) 
      	 )
            Brake_Train ( 0 0.99 0.0475 0.65 
            NumNotches( 4
            Notch( 0     0 TrainBrakesControllerReleaseStart )
            Notch( 0.05  0 TrainBrakesControllerRunningStart )
		Notch( 0.2   0 TrainBrakesControllerSelfLapStart )
            Notch( 0.3   1 TrainBrakesControllerApplyStart )
                )
            )
            Brake_Hand ( 0 1 0.0125 0 
            NumNotches( 0 )
            )
            FireDoor ( 0 1 0.075 1 
            NumNotches( 0 )
            )
            Sanding( 0 1 0 )
            Blower ( 0 1 0.025 0.2 
            NumNotches( 0 )
            )
            HeatingTap ( 0 1 0.035 0 
            NumNotches( 5 
         	Notch ( 0    0 Dummy )
            Notch ( 0.25 1 Dummy )
            Notch ( 0.5  1 Dummy )
            Notch ( 0.75 1 Dummy )
            Notch ( 1    1 Dummy )
         		)
            )
            Shovel ( 0 2 0.5 0 
            NumNotches( 0 ) 
    			)
            DampersFront ( 0 1 0.025 0.15 
            NumNotches ( 0 )
            )  
    		Injector1Steam ( 0 1 0 )
            Injector2Steam ( 0 0.75 0 )
            Injector1Water ( 0 1 0.1 0 
            NumNotches( 2 
         	Notch ( 0  0 Dummy )
            Notch ( 1  0 Dummy )
         		 )
            )
            Injector2Water ( 0 1 0.1 0 
            NumNotches( 5 
            Notch ( 0      0 Dummy )
            Notch ( 0.25 0 Dummy )
            Notch ( 0.5  0 Dummy )
            Notch ( 0.75 0 Dummy )
            Notch ( 1    0 Dummy )
      		)
    		)
            CylinderCocks ( 0 1 1 )
            Whistle ( 0 1 0 )
            WaterScoop ( 0 1 0 )
            SmallEjectorOrCompressor( 0 1 1 )
            Headlights( 0 1 0 )
        )

 comment(fire temp, fire mass, water mass, boiler pressure,
  water level, tender_water_mass, tender_coal_mass,
  smoke_quantity, fire_condition, coal quality )
  
 EngineVariables( 700 2740 4056 230 1 42500 45 20 1 0.75 )
    	Sound ( "..\\..\\Common.Sound\\2cyl_generic\\2c-100b-cab-5MT.sms" )

      Name ( "MML Std 5 73003" )

    Description (
        "73003 was allocated to Leicester Midland in the mid to late fifties before going to Bristol Barrow Road. This has an allocation of Leicester Midland 15C.\n\n"
    )
	EngineOperatingProcedures (
	"To move forward\n"+
	"1.	Press the W key several times to move the Reverser to full Forward.\n"+
	"2.	Press the ; (SEMICOLON) key to release the train brakes.\n"+
	"3.	Press the D key to increase the Regulator setting.\n"+  
	"4.	As you accelerate, press the S key to slowly reduce the Reverser setting, then adjust the Regulator to maintain the desired speed.\n\n"+
	"To slow the train\n"+
	"1.	Press the A key to move the Regulator to a lower setting.\n"+
	"2.	Use the brakes to further reduce speed if desired.\n\n"+
	"To apply the train brakes\n"+
	"1.	Press the ' (APOSTROPHE) key to apply the train brakes.\n"+
	"2. To hold the brakes at their current setting, lower the brake lever until it's in its middle (Neutral) position, by pressing the ; (SEMICOLON) key.\n\n"+
	"To release the train brakes\n"+
	"1. Press  the ; (SEMICOLON) key to release the train brakes.\n"+
	"2. When the brakes are released, raise the brake lever until it's in its middle (Neutral) position, by pressing the ' (APOSTROPHE) key.\n\n"+
	"To back up\n"+
	"1.	Bring your train to a full stop.\n"+ 
	"2.	Press the S key several times to move the Reverser to the full Reverse position.\n"+
	"4.	Press the ; (SEMICOLON) key to release the brakes.\n"+
	"5.	Slowly advance the regulator (D key).\n\n"+
	"To load and unload passengers\n"+
	"1. Stop at a station.\n"+
	"2. Press the ENTER key.\n"+
	"3. Wait for the \"permission to depart\" whistle.\n"+
	"TIP: Use the Next Station driving aid (F10) to monitor loading and unloading.\n\n"+
	"To couple to a car or locomotive\n"+
	"1. Coast into the unit at a very slow speed, about 2 mph.\n"+
	"TIP: To use the Coupling view, press the 6 key.\n"+
	"2. Press F9 to open the Train Operations window.\n"+
	"3. If the icon for the unit you coupled to is red, the handbrake is on. Double-click the car to release the handbrake.\n"+
	"4. Close the Train Operations window.\n\n"+
	"To uncouple from a car or locomotive\n"+
	"1. Press F9 to open the Train Operations window.\n"+
	"2. Double-click a unit in the part of the train you want to uncouple from the locomotive, to set the handbrake.\n"+
	"3. Double-click the coupler between the units you want to uncouple and the rest of the train.\n"+
	"4. Close the Train Operations window.\n\n"+
	"Firing commands (Automatic Fireman OFF in Options screen)\n"+
	"To add coal to the firebox\n"+
	"1. Press the F key to open the Firebox door.\n"+
	"2. Press the R key to increase the shoveling rate.\n\n"+
	"To stop adding coal to the fire\n"+
	"1. Press SHIFT+R to decrease the shoveling rate.\n"+
	"2. Press SHIFT+F to close the firebox door.\n\n"+
	"To operate the blower\n"+
	"1.	Press the N key to increase the blower.\n"+
	"2. Press SHIFT+N to decrease the blower.\n\n"+
	"To operate the dampers\n"+
	"1.	Press the M key to open the dampers.\n"+
	"2. Press SHIFT+M to close the dampers.\n\n"+
	"To inject water into the boiler\n"+
	"1.	Press the I key to turn on the steam to Injector 1.\n"+
	"(You can also press the O key to turn on the steam to Injector 2.)\n"+
	"2.	Press the K key to increase the water flow to Injector 1.\n"+
	"(To increase the water flow to Injector 2, press the L key.)\n\n"+
	"To stop boiler water injection\n"+ 
	"1. Press the I key to turn off the steam to Injector 1.\n"+
	"2. Press the O key to turn off the steam to Injector 2."
	)
)






